/*编写一个程序，程序的功能是求出一个3＊4的矩阵中每一行值最大的那个元素的值，以及其所在的行号和列号。矩阵如下：
int a[3][4]={{1,2,3,4},{9,8,7,6},{-10,10,-5,2}}*/
#include <stdio.h>
int main(void)
{
    int a[3][4] = {{1, 2, 3, 4}, {9, 8, 7, 6}, {-10, 10, -5, 2}}, i, n, l[3], max[3];
    for (i = 0; i < 3; i++)
    {
        max[i] = a[i][0];
        l[i] = 1;
        for (n = 0; n < 4; n++)
            if (a[i][n] > max[i])
            {
                max[i] = a[i][n];
                l[i] = n + 1;
            }
    }
    printf("%d 1 %d %d 2 %d %d 3 %d", max[0], l[0], max[1], l[1], max[2], l[2]);
}