/*编写一个程序，程序的功能是求出一个3＊4的矩阵中值最大的那个元素的值，以及其所在的行号和列号。矩阵如下：
int a[3][4]={{1,2,3,4},{9,8,7,6},{-10,10,-5,2}}*/
#include <stdio.h>
int main(void)
{
    int a[3][4] = {{1, 2, 3, 4}, {9, 8, 7, 6}, {-10, 10, -5, 2}}, i, n, h, l, max;
    max = a[0][0];
    for (i = 0; i < 3; i++)
        for (n = 0; n < 4; n++)
            if (a[i][n] > max)
            {
                max = a[i][n];
                h = i + 1;
                l = n + 1;
            }
    printf("%d %d %d", a[h - 1][l - 1], h, l);
}