/*编写一个程序，程序的功能是将满足下列条件所有可能的零件总数保存到数组int num[100]中，最后输出所有满足条件的零件堆数，以及以每行5个输出零件总数。
条件：有一堆零件，总数在1000到2000之间并且满足：若按4个零件分组，则多2个；若按7个零件分组，则多3个。*/
#include <stdio.h>
int main(void)
{
    int num[1000], i = 0, k = 0;
    for (num[i] = 1000; i < 1000; i++, num[i] = num[i - 1] + 1)
    {
        if (num[i] >= 1000 && num[i] <= 2000 && num[i] % 4 == 2 && num[i] % 7 == 3)
        {
            printf("%d ", num[i]);
            k++;
            if (k % 5 == 0)
                printf("\n");
        }
    }
}